[
  {
    "id": "indicators_1",
    "title": "RSI: Göreceli Güç Endeksi",
    "description": "Piyasanın aşırı alım veya aşırı satım bölgelerini belirlemek için güçlü bir momentum osilatörü.",
    "type": "interactive",
    "estimatedTime": "25 dk",
    "order": 1,
    "isCompleted": false,
    "isLocked": false,
    "prerequisites": [],
    "content": [
      {
        "id": "indicators_1_content_1",
        "type": "textContent",
        "title": "RSI Nedir ve Nasıl Hesaplanır?",
        "content": "Göreceli Güç Endeksi (Relative Strength Index - RSI), J. Welles Wilder tarafından geliştirilen, fiyat hareketlerinin hızını ve değişimini ölçen bir momentum osilatörüdür. 0 ile 100 arasında bir değer alır.\n\nRSI, belirli bir periyottaki (genellikle 14 periyot) ortalama kazançların, ortalama kayıplara oranını kullanarak hesaplanır. Yüksek RSI değerleri, varlığın son dönemde güçlü bir şekilde yükseldiğini ve potansiyel olarak 'aşırı alınmış' olabileceğini gösterirken; düşük RSI değerleri, güçlü bir düşüş yaşandığını ve 'aşırı satılmış' olabileceğini işaret eder.",
        "bulletPoints": [
          "Momentum osilatörüdür, fiyat değişiminin hızını ölçer.",
          "Genellikle 14 periyotluk ayar kullanılır.",
          "0-100 arasında salınır.",
          "70 üzeri aşırı alım, 30 altı aşırı satım bölgesi kabul edilir."
        ],
        "definitions": {
          "Momentum": "Bir fiyat hareketinin hızı veya gücüdür. Yükselen momentumda fiyatlar hızla yükselir.",
          "Osilatör": "Belirli bir merkez çizgisi veya aralık etrafında dalgalanan bir gösterge türüdür.",
          "Aşırı Alım": "Bir varlığın çok hızlı yükseldiği ve fiyatının kısa vadede düşebileceği durumu ifade eder.",
          "Aşırı Satım": "Bir varlığın çok hızlı düştüğü ve fiyatının kısa vadede yükselebileceği durumu ifade eder."
        }
      },
      {
        "id": "indicators_1_interactive_1",
        "type": "interactiveEducationChart",
        "title": "RSI Çalışma Prensibi - İnteraktif Demo",
        "description": "Gerçek piyasa verilerini simüle eden bu grafikte RSI'ın nasıl çalıştığını görün. Farklı periyotları deneyerek RSI'ın hassasiyetinin nasıl değiştiğini keşfedin.",
        "indicatorType": "rsi",
        "learningPoints": [
          "RSI 70'in üzerinde olduğunda varlık aşırı alınmış olabilir ve satış fırsatı doğabilir",
          "RSI 30'un altında olduğunda varlık aşırı satılmış olabilir ve alış fırsatı doğabilir",
          "RSI sinyalleri tek başına kullanılmamalı, trend analizi ile desteklenmelidir",
          "Güçlü trendlerde RSI uzun süre aşırı bölgelerde kalabilir",
          "Divergence (uyumsuzluk) sinyalleri güçlü reversal işaretleri verebilir"
        ]
      },
      {
        "id": "indicators_1_content_2",
        "type": "textContent",
        "title": "RSI Stratejileri ve Uygulamaları",
        "content": "RSI'ın en yaygın kullanım alanları şunlardır:\n\n1. **Aşırı Alım ve Aşırı Satım Bölgeleri:**\n   - RSI 70'in üzerine çıktığında satış sinyali aranabilir\n   - RSI 30'un altına indiğinde alış sinyali aranabilir\n   - Bu seviyeleri 80-20 veya 75-25 olarak da ayarlayabilirsiniz\n\n2. **Uyumsuzluklar (Divergence):**\n   - Pozitif Uyumsuzluk: Fiyat daha düşük dip yaparken RSI daha yüksek dip yapar\n   - Negatif Uyumsuzluk: Fiyat daha yüksek tepe yaparken RSI daha düşük tepe yapar\n\n3. **Trend Teyidi:**\n   - Yükseliş trendinde RSI genellikle 40-90 arasında hareket eder\n   - Düşüş trendinde RSI genellikle 10-60 arasında hareket eder",
        "bulletPoints": [
          "RSI sinyallerini trend yönünde kullanmak daha güvenlidir",
          "Hacim analizi ile desteklenen RSI sinyalleri daha güçlüdür",
          "Farklı zaman dilimlerinde RSI'ı kontrol etmek önemlidir",
          "RSI ile support/resistance seviyelerini birleştirmek etkilidir"
        ],
        "definitions": {
          "Divergence": "Fiyat ve gösterge arasındaki uyumsuzluk. Trendin zayıfladığını işaret edebilir.",
          "False Signal": "Yanıltıcı sinyal. RSI'da özellikle trending piyasalarda sık görülür."
        }
      },
      {
        "id": "indicators_1_interactive_2",
        "type": "interactiveEducationChart",
        "title": "RSI Ticaret Sinyalleri - Gerçek Senaryolar",
        "description": "Bu simülasyonda farklı piyasa koşullarında RSI sinyallerinin nasıl çalıştığını görün. Başarılı ve başarısız sinyalleri analiz edin.",
        "indicatorType": "rsi",
        "learningPoints": [
          "Trend yönünde alınan RSI sinyalleri daha başarılıdır",
          "RSI 50 seviyesi önemli bir destek/direnç görevi görebilir",
          "Volatil piyasalarda RSI daha sık sinyal üretir",
          "RSI sinyallerini volume ile teyit etmek önemlidir",
          "Farklı asset'lerde RSI'ın davranışı değişiklik gösterebilir"
        ]
      }
    ],
    "quiz": null
  },
  {
    "id": "indicators_2",
    "title": "MACD: Moving Average Convergence Divergence",
    "description": "Trend değişimlerini ve momentum değişikliklerini tespit etmek için kullanılan güçlü bir trend-following göstergesi.",
    "type": "interactive",
    "estimatedTime": "30 dk",
    "order": 2,
    "isCompleted": false,
    "isLocked": true,
    "prerequisites": ["indicators_1"],
    "content": [
      {
        "id": "indicators_2_content_1",
        "type": "textContent",
        "title": "MACD'nin Yapısı ve Hesaplanması",
        "content": "MACD, Gerald Appel tarafından geliştirilen ve üç bileşenden oluşan bir teknical indicator'dür:\n\n1. **MACD Çizgisi**: 12 periyotluk EMA ile 26 periyotluk EMA arasındaki fark\n2. **Sinyal Çizgisi**: MACD çizgisinin 9 periyotluk EMA'sı\n3. **Histogram**: MACD çizgisi ile Sinyal çizgisi arasındaki fark\n\nMACD hem trend hem de momentum bilgisi sağlar. Pozitif MACD değerleri yükseliş momentumunu, negatif değerler ise düşüş momentumunu gösterir.",
        "bulletPoints": [
          "Trend following ve momentum göstergesi özelliklerini birleştirir",
          "Standart ayarlar: 12, 26, 9 periyot",
          "Hem çizgi grafiği hem de histogram olarak görüntülenebilir",
          "Zero line önemli bir referans noktasıdır"
        ],
        "definitions": {
          "EMA (Exponential Moving Average)": "Son fiyatlara daha fazla ağırlık veren hareketli ortalama türü.",
          "Convergence": "İki çizginin birbirine yaklaşması durumu.",
          "Divergence": "İki çizginin birbirinden uzaklaşması durumu.",
          "Zero Line": "MACD'de sıfır çizgisi, 12 EMA ile 26 EMA'nın eşit olduğu noktadır."
        }
      },
      {
        "id": "indicators_2_interactive_1",
        "type": "interactiveEducationChart",
        "title": "MACD Bileşenleri - İnteraktif Analiz",
        "description": "MACD'nin üç bileşenini detaylı olarak inceleyin. Histogram, MACD çizgisi ve sinyal çizgisinin nasıl etkileşim halinde olduğunu görün.",
        "indicatorType": "macd",
        "learningPoints": [
          "MACD çizgisi sinyal çizgisini yukarı kestiğinde bullish sinyal oluşur",
          "MACD çizgisi sinyal çizgisini aşağı kestiğinde bearish sinyal oluşur",
          "Histogram pozitifken MACD sinyal çizgisinin üzerindedir",
          "Histogram sıfıra yaklaştığında crossover yaklaşıyor demektir",
          "Zero line crossover'ları güçlü trend değişimi sinyalleridir"
        ]
      }
    ],
    "quiz": null
  }
]